In [1]:
import psycopg2
import pandas as pd

In [2]:
def create_database():
    # connect to default database
    conn = psycopg2.connect("host=localhost dbname=postgres user=postgres password=admin@123")
    conn.set_session(autocommit=True)
    cur = conn.cursor()

    # Check if the 'players' database exists
    cur.execute("SELECT 1 FROM pg_database WHERE datname = 'players'")
    database_exists = cur.fetchone()

    if database_exists:
        # Drop the 'players' database if it exists
        cur.execute("DROP DATABASE players")

    # Create the 'players' database with UTF8 encoding
    cur.execute("CREATE DATABASE players")

    # close connection to default database
    conn.close()

    # connect to the 'players' database
    conn = psycopg2.connect("host=localhost dbname=players user=postgres password=admin@123")
    cur = conn.cursor()

    return cur, conn

In [3]:
def drop_tables(cur, conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [4]:
def create_tables(cur, conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

In [6]:
PlayersCountry = pd.read_csv("data/IPL_PLAYERS.csv")

In [7]:
PlayersCountry.head()

                PLAYERS NATIONALITY           TYPE  PRICE PAID TEAM
0  Avanish Rao Aravelly      Indian  Wicket-Keeper     2000000  CSK
1     Mustafizur Rahman    Overseas         Bowler    20000000  CSK
2        Daryl Mitchell    Overseas    All-Rounder   140000000  CSK
3          Sameer Rizvi      Indian         Batter    84000000  CSK
4       Rachin Ravindra    Overseas    All-Rounder    18000000  CSK

In [8]:
PlayersCountry_clean = PlayersCountry[['PLAYERS','NATIONALITY','TEAM']]

In [9]:
PlayersCountry_clean.head()

                PLAYERS NATIONALITY TEAM
0  Avanish Rao Aravelly      Indian  CSK
1     Mustafizur Rahman    Overseas  CSK
2        Daryl Mitchell    Overseas  CSK
3          Sameer Rizvi      Indian  CSK
4       Rachin Ravindra    Overseas  CSK

In [10]:
PlayersTopBuys = pd.read_csv("data/TOP_BUYS.csv")

In [11]:
PlayersTopBuys.head()

                          TEAM     NATIONALITY         TYPE     PRICE PAID
0        Kolkata Knight Riders  Mitchell Starc       Bowler   24,75,00,000
1          Sunrisers Hyderabad     Pat Cummins  All-Rounder   20,50,00,000
2          Chennai Super Kings  Daryl Mitchell  All-Rounder   14,00,00,000
3                 Punjab Kings   Harshal Patel  All-Rounder   11,75,00,000
4  Royal Challengers Bangalore  Alzarri Joseph       Bowler   11,50,00,000

In [12]:
PlayersTopBuys.columns

Index(['TEAM', 'NATIONALITY', 'TYPE', 'PRICE PAID'], dtype='object')

In [13]:
UnsoldPlayers = pd.read_csv("data/UNSOLD_PLAYERS.csv")

In [14]:
UnsoldPlayers.head()

            PLAYER NATIONALITY         TYPE  BASE PRICE
0    Priyansh Arya      Indian       Batter     2000000
1  Rohan Kunnummal      Indian       Batter     2000000
2      Manan Vohra      Indian       Batter     2000000
3   Raj Angad Bawa      Indian  All-Rounder     2000000
4    Sarfaraz Khan      Indian  All-Rounder     2000000

In [15]:
cur, conn = create_database()

In [16]:
players_table_create = ("""CREATE TABLE IF NOT EXISTS players (
                        nationality VARCHAR PRIMARY KEY,
                        player_name VARCHAR,
                        team VARCHAR,
                        type VARCHAR
                        )""")

In [17]:
cur.execute(players_table_create)
conn.commit()

In [ ]:
players_table_create = ("""CREATE TABLE IF NOT EXISTS players_top_buys (
                        player_name VARCHAR PRIMARY KEY,
                        team VARCHAR,
                        type VARCHAR,
                        price VARCHAR
                        )""")